tiborsimon/embedded-tdd-headers/pic/pic18/pic18f65k22_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18F65K22_H_
#define _PIC18F65K22_H_

#define PMD3                          0
#define CCP4MD                        1
#define CCP5MD                        2
#define CCP6MD                        3
#define CCP7MD                        4
#define CCP8MD                        5
#define PMD2                          6
#define CMP1MD                        7
#define CMP2MD                        8
#define CMP3MD                        9
#define TMR5MD                        10
#define TMR6MD                        11
#define TMR8MD                        12
#define PMD1                          13
#define TMR1MD                        14
#define TMR2MD                        15
#define TMR3MD                        16
#define TMR4MD                        17
#define RTCCMD                        18
#define CTMUMD                        19
#define PSPMD                         20
#define PMD0                          21
#define ADCMD                         22
#define SSP1MD                        23
#define SPI1MD                        24
#define SPI2MD                        25
#define SSP2MD                        26
#define UART1MD                       27
#define UART2MD                       28
#define CCP1MD                        29
#define CCP2MD                        30
#define CCP3MD                        31
#define PSTR3CON                      32
#define PSTR3CON_STRA                 33
#define STRA3                         34
#define STRB3                         35
#define PSTR3CON_STRB                 36
#define PSTR3CON_STRC                 37
#define STRC3                         38
#define STRD3                         39
#define PSTR3CON_STRD                 40
#define STRSYNC3                      41
#define PSTR3CON_STRSYNC              42
#define PSTR3CON_CMPL0                43
#define CMPL03                        44
#define PSTR3CON_CMPL                 45
#define CMPL13                        46
#define PSTR3CON_CMPL1                47
#define PSTR2CON                      48
#define PSTR2CON_STRA                 49
#define P2DC02                        50
#define STRA2                         51
#define P2DC0CON                      52
#define STRB2                         53
#define P2DC12                        54
#define PSTR2CON_STRB                 55
#define P2DC1CON                      56
#define STRC2                         57
#define PSTR2CON_STRC                 58
#define P2DC22                        59
#define P2DC2CON                      60
#define P2DC32                        61
#define STRD2                         62
#define PSTR2CON_STRD                 63
#define P2DC3CON                      64
#define P2DC4CON                      65
#define STRSYNC2                      66
#define PSTR2CON_STRSYNC              67
#define P2DC42                        68
#define P2DC6CON                      69
#define PSTR2CON_CMPL                 70
#define CMPL02                        71
#define P2DC62                        72
#define PSTR2CON_CMPL0                73
#define CMPL12                        74
#define PSTR2CON_CMPL1                75
#define TXREG2                        76
#define RCREG2                        77
#define SPBRG2                        78
#define SPBRGH2                       79
#define BAUDCON2                      80
#define ABDEN2                        81
#define BAUDCON2_ABDEN                82
#define WUE2                          83
#define BAUDCON2_WUE                  84
#define BRG162                        85
#define BAUDCON2_BRG16                86
#define SCKP2                         87
#define TXCKP2                        88
#define BAUDCON2_TXCKP                89
#define DTRXP2                        90
#define RXDTP2                        91
#define BAUDCON2_RXDTP                92
#define RCMT2                         93
#define RCIDL2                        94
#define BAUDCON2_RCIDL                95
#define BAUDCON2_ABDOVF               96
#define ABDOVF2                       97
#define TXSTA2                        98
#define TX9D2                         99
#define TXSTA2_TX9D                   100
#define TXD82                         101
#define TRMT2                         102
#define TXSTA2_TRMT                   103
#define BRGH2                         104
#define TXSTA2_BRGH                   105
#define SENDB2                        106
#define TXSTA2_SENDB                  107
#define TXSTA2_SYNC                   108
#define SYNC2                         109
#define TXEN2                         110
#define TXSTA2_TXEN                   111
#define TX8_92                        112
#define TX92                          113
#define TXSTA2_TX9                    114
#define TXSTA2_CSRC                   115
#define CSRC2                         116
#define RCSTA2                        117
#define RCD82                         118
#define RX9D2                         119
#define RCSTA2_RX9D                   120
#define OERR2                         121
#define RCSTA2_OERR                   122
#define FERR2                         123
#define RCSTA2_FERR                   124
#define ADDEN2                        125
#define RCSTA2_ADDEN                  126
#define RCSTA2_CREN                   127
#define CREN2                         128
#define SREN2                         129
#define RCSTA2_SREN                   130
#define RC92                          131
#define RC8_92                        132
#define RCSTA2_RX9                    133
#define RX92                          134
#define RCSTA2_SPEN                   135
#define SPEN2                         136
#define ANCON2                        137
#define PCFG16                        138
#define ANSEL16                       139
#define PCFG17                        140
#define ANSEL17                       141
#define PCFG18                        142
#define ANSEL18                       143
#define PCFG19                        144
#define ANSEL19                       145
#define ANCON1                        146
#define ANSEL8                        147
#define PCFG8                         148
#define ANSEL9                        149
#define PCFG9                         150
#define PCFG10                        151
#define ANSEL10                       152
#define ANSEL11                       153
#define PCFG11                        154
#define ANCON0                        155
#define ANSEL0                        156
#define PCFG0                         157
#define ANSEL1                        158
#define PCFG1                         159
#define ANSEL2                        160
#define PCFG2                         161
#define ANSEL3                        162
#define PCFG3                         163
#define ANSEL4                        164
#define PCFG4                         165
#define ANSEL5                        166
#define PCFG5                         167
#define ANSEL6                        168
#define PCFG6                         169
#define ANSEL7                        170
#define PCFG7                         171
#define ODCON3                        172
#define CTMUDS                        173
#define U1OD                          174
#define U2OD                          175
#define ODCON2                        176
#define CCP3OD                        177
#define CCP4OD                        178
#define CCP5OD                        179
#define CCP6OD                        180
#define CCP7OD                        181
#define CCP8OD                        182
#define ODCON1                        183
#define SPI2OD                        184
#define CCP1OD                        185
#define CCP2OD                        186
#define SPI1OD                        187
#define REFOCON                       188
#define RODIV0                        189
#define RODIV                         190
#define RODIV1                        191
#define RODIV2                        192
#define RODIV3                        193
#define ROSEL                         194
#define ROSSLP                        195
#define ROON                          196
#define CCPTMRS2                      197
#define C8TSEL0                       198
#define C8TSEL                        199
#define C8TSEL1                       200
#define CCPTMRS1                      201
#define C4TSEL                        202
#define C4TSEL0                       203
#define C4TSEL1                       204
#define C5TSEL0                       205
#define C6TSEL0                       206
#define C7TSEL                        207
#define C7TSEL0                       208
#define C7TSEL1                       209
#define CCPTMRS0                      210
#define C1TSEL0                       211
#define C1TSEL                        212
#define C1TSEL1                       213
#define C1TSEL2                       214
#define C2TSEL0                       215
#define C2TSEL                        216
#define C2TSEL1                       217
#define C2TSEL2                       218
#define C3TSEL0                       219
#define C3TSEL                        220
#define C3TSEL1                       221
#define CM3CON                        222
#define CM3CON_CCH                    223
#define CCH03                         224
#define CM3CON_CCH0                   225
#define CCH13                         226
#define CM3CON_CCH1                   227
#define CM3CON_CREF                   228
#define CREF3                         229
#define CM3CON_EVPOL                  230
#define EVPOL03                       231
#define CM3CON_EVPOL0                 232
#define CM3CON_EVPOL1                 233
#define EVPOL13                       234
#define CM3CON_CPOL                   235
#define CPOL3                         236
#define COE3                          237
#define CM3CON_COE                    238
#define CM3CON_CON                    239
#define CON3                          240
#define CM2CON                        241
#define CM2CON_CCH                    242
#define CM2CON_CCH0                   243
#define CCH02                         244
#define CCH12                         245
#define CM2CON_CCH1                   246
#define CM2CON_CREF                   247
#define CREF2                         248
#define CM2CON_EVPOL                  249
#define EVPOL02                       250
#define CM2CON_EVPOL0                 251
#define EVPOL12                       252
#define CM2CON_EVPOL1                 253
#define CM2CON_CPOL                   254
#define CPOL2                         255
#define CM2CON_COE                    256
#define COE2                          257
#define CM2CON_CON                    258
#define CON2                          259
#define T8CON                         260
#define T8CKPS0                       261
#define T8CKPS                        262
#define T8CKPS1                       263
#define TMR8ON                        264
#define T8OUTPS                       265
#define T8OUTPS0                      266
#define T8OUTPS1                      267
#define T8OUTPS2                      268
#define T8OUTPS3                      269
#define PR8                           270
#define TMR8                          271
#define T6CON                         272
#define T6CKPS0                       273
#define T6CKPS                        274
#define T6CKPS1                       275
#define TMR6ON                        276
#define T6OUTPS0                      277
#define T6OUTPS                       278
#define T6OUTPS1                      279
#define T6OUTPS2                      280
#define T6OUTPS3                      281
#define PR6                           282
#define TMR6                          283
#define CCP8CON                       284
#define CCP8M0                        285
#define CCP8M                         286
#define CCP8M1                        287
#define CCP8M2                        288
#define CCP8M3                        289
#define DC8B0                         290
#define CCP8Y                         291
#define DC8B                          292
#define DC8B1                         293
#define CCP8X                         294
#define CCPR8L                        295
#define CCPR8H                        296
#define CCP3CON                       297
#define CCP3M                         298
#define CCP3M0                        299
#define CCP3M1                        300
#define CCP3M2                        301
#define CCP3M3                        302
#define DC3B                          303
#define DC3B0                         304
#define DC3B1                         305
#define P3M                           306
#define P3M0                          307
#define P3M1                          308
#define CCPR3L                        309
#define CCPR3H                        310
#define ECCP3DEL                      311
#define P3DC                          312
#define P3DC0                         313
#define P3DC1                         314
#define P3DC2                         315
#define P3DC3                         316
#define P3DC4                         317
#define P3DC5                         318
#define P3DC6                         319
#define P3RSEN                        320
#define PSS3BD0                       321
#define PSS3BD                        322
#define PSS3BD1                       323
#define PSS3AC0                       324
#define PSS3AC                        325
#define PSS3AC1                       326
#define ECCP3AS                       327
#define ECCP3AS0                      328
#define ECCP3AS1                      329
#define ECCP3AS2                      330
#define ECCP3ASE                      331
#define CCP2CON                       332
#define CCP2M                         333
#define CCP2M0                        334
#define CCP2M1                        335
#define CCP2M2                        336
#define CCP2M3                        337
#define DC2B                          338
#define DC2B0                         339
#define CCP2Y                         340
#define DC2B1                         341
#define CCP2X                         342
#define P2M                           343
#define P2M0                          344
#define P2M1                          345
#define CCPR2L                        346
#define CCPR2H                        347
#define ECCP2DEL                      348
#define P2DC                          349
#define P2DC0                         350
#define P2DC1                         351
#define P2DC2                         352
#define P2DC3                         353
#define P2DC4                         354
#define P2DC5                         355
#define P2DC6                         356
#define P2RSEN                        357
#define PSS2BD                        358
#define PSS2BD0                       359
#define PSS2BD1                       360
#define PSS2AC0                       361
#define PSS2AC                        362
#define PSS2AC1                       363
#define ECCP2AS0                      364
#define ECCP2AS                       365
#define ECCP2AS1                      366
#define ECCP2AS2                      367
#define ECCP2ASE                      368
#define PADCFG1                       369
#define RTSECSEL0                     370
#define RTSECSEL                      371
#define RTSECSEL1                     372
#define REPU                          373
#define RDPU                          374
#define CM1CON                        375
#define CM1CON_CCH                    376
#define C1CH0                         377
#define CM1CON_CCH0                   378
#define CCH01                         379
#define CCH11                         380
#define C1CH1                         381
#define CM1CON_CCH1                   382
#define CM1CON_CREF                   383
#define CREF1                         384
#define EVPOL01                       385
#define CM1CON_EVPOL0                 386
#define CM1CON_EVPOL                  387
#define CM1CON_EVPOL1                 388
#define EVPOL11                       389
#define CM1CON_CPOL                   390
#define CPOL1                         391
#define CM1CON_COE                    392
#define COE1                          393
#define CM1CON_CON                    394
#define CON1                          395
#define CTMUICON                      396
#define IRNG                          397
#define IRNG0                         398
#define IRNG1                         399
#define ITRIM0                        400
#define ITRIM                         401
#define ITRIM1                        402
#define ITRIM2                        403
#define ITRIM3                        404
#define ITRIM4                        405
#define ITRIM5                        406
#define CTMUCONL                      407
#define EDG1STAT                      408
#define EDG2STAT                      409
#define EDG1SEL                       410
#define EDG1SEL0                      411
#define EDG1SEL1                      412
#define EDG1POL                       413
#define EDG2SEL0                      414
#define EDG2SEL                       415
#define EDG2SEL1                      416
#define EDG2POL                       417
#define CTMUCONH                      418
#define CTTRIG                        419
#define IDISSEN                       420
#define EDGSEQEN                      421
#define EDGEN                         422
#define TGEN                          423
#define CTMUSIDL                      424
#define CTMUEN                        425
#define ALRMVALL                      426
#define ALRMVALH                      427
#define ALRMRPT                       428
#define ARPT0                         429
#define ARPT                          430
#define ARPT1                         431
#define ARPT2                         432
#define ARPT3                         433
#define ARPT4                         434
#define ARPT5                         435
#define ARPT6                         436
#define ARPT7                         437
#define ALRMCFG                       438
#define ALRMPTR                       439
#define ALRMPTR0                      440
#define ALRMPTR1                      441
#define AMASK0                        442
#define AMASK                         443
#define AMASK1                        444
#define AMASK2                        445
#define AMASK3                        446
#define CHIME                         447
#define ALRMEN                        448
#define RTCVALL                       449
#define WAITE0                        450
#define RTCVALH                       451
#define WAITE1                        452
#define WAITM0                        453
#define WAITM1                        454
#define WAITM2                        455
#define WAITM3                        456
#define WAITB0                        457
#define WAITB1                        458
#define RTCCAL                        459
#define CAL0                          460
#define CAL                           461
#define CAL1                          462
#define CAL2                          463
#define CAL3                          464
#define CAL4                          465
#define CAL5                          466
#define CAL6                          467
#define CAL7                          468
#define RTCCFG                        469
#define RTCPTR0                       470
#define RTCPTR                        471
#define RTCPTR1                       472
#define RTCOE                         473
#define HALFSEC                       474
#define RTCSYNC                       475
#define RTCWREN                       476
#define RTCEN                         477
#define PIE6                          478
#define CMP1IE                        479
#define CMP2IE                        480
#define CMP3IE                        481
#define EEIE                          482
#define EEDATA                        483
#define EEADR                         484
#define EEADRH                        485
#define OSCCON2                       486
#define MFIOSEL                       487
#define MFIOFS                        488
#define SOSCGO                        489
#define SOSCRUN                       490
#define BAUDCON1                      491
#define BAUDCON1_ABDEN                492
#define ABDEN1                        493
#define BAUDCON1_WUE                  494
#define WUE1                          495
#define W4E                           496
#define BRG161                        497
#define BAUDCON1_BRG16                498
#define CKTXP                         499
#define BAUDCON1_TXCKP                500
#define SCKP1                         501
#define TXCKP1                        502
#define SCKP                          503
#define DTRXP1                        504
#define RXDTP1                        505
#define DTRXP                         506
#define RXCKP                         507
#define BAUDCON1_RXDTP                508
#define RCMT1                         509
#define RCIDL1                        510
#define BAUDCON1_RCIDL                511
#define RCMT                          512
#define ABDOVF1                       513
#define BAUDCON1_ABDOVF               514
#define SSP2CON2                      515
#define SEN2                          516
#define SSP2CON2_SEN                  517
#define ADMSK12                       518
#define SSP2CON2_RSEN                 519
#define RSEN2                         520
#define SSP2CON2_ADMSK1               521
