tiborsimon/embedded-tdd-headers/pic/pic18/pic18f65k22_tdd.h
#define ADMSK22                       522
#define PEN2                          523
#define SSP2CON2_PEN                  524
#define SSP2CON2_ADMSK2               525
#define ADMSK32                       526
#define SSP2CON2_RCEN                 527
#define RCEN2                         528
#define SSP2CON2_ADMSK3               529
#define ACKEN2                        530
#define ADMSK42                       531
#define SSP2CON2_ADMSK4               532
#define SSP2CON2_ACKEN                533
#define ACKDT2                        534
#define ADMSK52                       535
#define SSP2CON2_ACKDT                536
#define SSP2CON2_ADMSK5               537
#define SSP2CON2_ACKSTAT              538
#define ACKSTAT2                      539
#define SSP2CON2_GCEN                 540
#define GCEN2                         541
#define SSP2CON1                      542
#define SSP2CON1_SSPM                 543
#define SSP2CON1_SSPM0                544
#define SSPM02                        545
#define SSPM12                        546
#define SSP2CON1_SSPM1                547
#define SSP2CON1_SSPM2                548
#define SSPM22                        549
#define SSPM32                        550
#define SSP2CON1_SSPM3                551
#define SSP2CON1_CKP                  552
#define CKP2                          553
#define SSPEN2                        554
#define SSP2CON1_SSPEN                555
#define SSPOV2                        556
#define SSP2CON1_SSPOV                557
#define WCOL2                         558
#define SSP2CON1_WCOL                 559
#define SSP2STAT                      560
#define SSP2STAT_BF                   561
#define BF2                           562
#define SSP2STAT_UA                   563
#define UA2                           564
#define SSP2STAT_R_W                  565
#define SSP2STAT_I2C_READ             566
#define RW2                           567
#define SSP2STAT_R                    568
#define SSP2STAT_nW                   569
#define READ_WRITE2                   570
#define nW2                           571
#define SSP2STAT_nWRITE               572
#define I2C_READ2                     573
#define SSP2STAT_R_NOT_W              574
#define R_nW2                         575
#define SSP2STAT_READ_WRITE           576
#define nWRITE2                       577
#define R_W2                          578
#define SSP2STAT_R_nW                 579
#define SSP2STAT_NOT_WRITE            580
#define SSP2STAT_S                    581
#define S2                            582
#define START2                        583
#define SSP2STAT_I2C_START            584
#define I2C_START2                    585
#define P2                            586
#define SSP2STAT_I2C_STOP             587
#define SSP2STAT_P                    588
#define STOP2                         589
#define I2C_STOP2                     590
#define I2C_DAT2                      591
#define SSP2STAT_D                    592
#define DATA_ADDRESS2                 593
#define SSP2STAT_D_NOT_A              594
#define SSP2STAT_I2C_DAT              595
#define D_A2                          596
#define SSP2STAT_NOT_ADDRESS          597
#define SSP2STAT_D_nA                 598
#define SSP2STAT_DATA_ADDRESS         599
#define SSP2STAT_nADDRESS             600
#define nA2                           601
#define DA2                           602
#define nADDRESS2                     603
#define D_nA2                         604
#define SSP2STAT_nA                   605
#define SSP2STAT_D_A                  606
#define SSP2STAT_CKE                  607
#define CKE2                          608
#define SSP2STAT_SMP                  609
#define SMP2                          610
#define MSK02                         611
#define SSP2ADD                       612
#define MSK12                         613
#define MSK22                         614
#define MSK32                         615
#define MSK42                         616
#define MSK52                         617
#define MSK62                         618
#define MSK72                         619
#define SSP2MSK                       620
#define SSP2MSK_MSK0                  621
#define SSP2MSK_MSK1                  622
#define SSP2MSK_MSK2                  623
#define SSP2MSK_MSK3                  624
#define SSP2MSK_MSK4                  625
#define SSP2MSK_MSK5                  626
#define SSP2MSK_MSK6                  627
#define SSP2MSK_MSK7                  628
#define SSP2BUF                       629
#define T4CON                         630
#define T4CKPS0                       631
#define T4CKPS                        632
#define T4CKPS1                       633
#define TMR4ON                        634
#define T4OUTPS                       635
#define T4OUTPS0                      636
#define T4OUTPS1                      637
#define T4OUTPS2                      638
#define T4OUTPS3                      639
#define PR4                           640
#define TMR4                          641
#define CCP7CON                       642
#define CCP7M0                        643
#define CCP7M                         644
#define CCP7M1                        645
#define CCP7M2                        646
#define CCP7M3                        647
#define DC7B                          648
#define CCP7Y                         649
#define DC7B0                         650
#define CCP7X                         651
#define DC7B1                         652
#define CCPR7L                        653
#define CCPR7H                        654
#define CCP6CON                       655
#define CCP6M                         656
#define CCP6M0                        657
#define CCP6M1                        658
#define CCP6M2                        659
#define CCP6M3                        660
#define CCP6Y                         661
#define DC6B0                         662
#define DC6B                          663
#define DC6B1                         664
#define CCP6X                         665
#define CCPR6L                        666
#define CCPR6H                        667
#define CCP5CON                       668
#define CCP5M0                        669
#define CCP5M                         670
#define CCP5M1                        671
#define CCP5M2                        672
#define CCP5M3                        673
#define CCP5Y                         674
#define DC5B0                         675
#define DC5B                          676
#define CCP5X                         677
#define DC5B1                         678
#define CCPR5L                        679
#define CCPR5H                        680
#define CCP4CON                       681
#define CCP4M                         682
#define CCP4M0                        683
#define CCP4M1                        684
#define CCP4M2                        685
#define CCP4M3                        686
#define CCP4Y                         687
#define DC4B0                         688
#define DC4B                          689
#define CCP4X                         690
#define DC4B1                         691
#define CCPR4L                        692
#define CCPR4H                        693
#define T5GCON                        694
#define T5GSS                         695
#define T5GSS0                        696
#define T5GSS1                        697
#define T5GVAL                        698
#define T5GGO_NOT_T5DONE              699
#define nT5DONE                       700
#define T5GGO_nT5DONE                 701
#define NOT_T5DONE                    702
#define T5GGO                         703
#define T5GSPM                        704
#define T5GTM                         705
#define T5GPOL                        706
#define TMR5GE                        707
#define T5CON                         708
#define TMR5ON                        709
#define T5CON_RD16                    710
#define RD165                         711
#define nT5SYNC                       712
#define NOT_T5SYNC                    713
#define SOSCEN5                       714
#define T5CON_SOSCEN                  715
#define T5CKPS                        716
#define T5CKPS0                       717
#define T5CKPS1                       718
#define TMR5CS0                       719
#define TMR5CS                        720
#define TMR5CS1                       721
#define TMR5L                         722
#define TMR5H                         723
#define EECON2                        724
#define EECON1                        725
#define RD                            726
#define WR                            727
#define WREN                          728
#define WRERR                         729
#define FREE                          730
#define CFGS                          731
#define EEFS                          732
#define EEPGD                         733
#define PORTA                         734
#define AN0                           735
#define ULPWUIN                       736
#define ULPWU                         737
#define RA0                           738
#define AN1                           739
#define RA1                           740
#define AN2                           741
#define RA2                           742
#define VREF_MINUS                    743
#define AN3                           744
#define VREF_PLUS                     745
#define RA3                           746
#define T0CKI                         747
#define RA4                           748
#define AN4                           749
#define T1CKI                         750
#define LVDIN                         751
#define RA5                           752
#define T3G                           753
#define HLVDIN                        754
#define CLKO                          755
#define RA6                           756
#define OSC2                          757
#define CLKI                          758
#define PORTA_RJPU                    759
#define RA7                           760
#define OSC1                          761
#define PORTB                         762
#define FLT0                          763
#define RB0                           764
#define INT0                          765
#define RB1                           766
#define INT1                          767
#define RB2                           768
#define INT2                          769
#define CTED1                         770
#define RB3                           771
#define CCP2_P2A                      772
#define INT3                          773
#define CCP2_PA2                      774
#define CTED2                         775
#define RB4                           776
#define KBI0                          777
#define PGM                           778
#define T3CKI                         779
#define RB5                           780
#define KBI1                          781
#define T1G                           782
#define PGC                           783
#define RB6                           784
#define KBI2                          785
#define PGD                           786
#define RB7                           787
#define KBI3                          788
#define PORTC                         789
#define SOSCO                         790
#define SCKLI                         791
#define RC0                           792
#define PORTC_CCP2                    793
#define PA2                           794
#define RC1                           795
#define SOSCI                         796
#define PORTC_P2A                     797
#define CCP1                          798
#define P1A                           799
#define PA1                           800
#define RC2                           801
#define SCK1                          802
#define SCL1                          803
#define RC3                           804
#define SDI1                          805
#define SDA1                          806
#define RC4                           807
#define SDO1                          808
#define RC5                           809
#define TX1                           810
#define RC6                           811
#define CK1                           812
#define RX1                           813
#define RC7                           814
#define DT1                           815
#define PORTD                         816
#define PSP0                          817
#define RD0                           818
#define CTPLS                         819
#define AD0                           820
#define PSP1                          821
#define RD1                           822
#define T5CKI                         823
#define T7G                           824
#define AD1                           825
#define PSP2                          826
#define RD2                           827
#define AD2                           828
#define PSP3                          829
#define RD3                           830
#define AD3                           831
#define PSP4                          832
#define RD4                           833
#define AD4                           834
#define SDO2                          835
#define PSP5                          836
#define RD5                           837
#define SDI2                          838
#define AD5                           839
#define SDA2                          840
#define SCK2                          841
#define PSP6                          842
#define RD6                           843
#define AD6                           844
#define SCL2                          845
#define SS2                           846
#define PSP7                          847
#define RD7                           848
#define NOT_SS2                       849
#define nSS2                          850
#define AD7                           851
#define PORTE                         852
#define P2D                           853
#define NOT_RD                        854
#define nRD                           855
#define PD2                           856
#define AD8                           857
#define RDE                           858
#define RE0                           859
#define P2C                           860
#define NOT_WR                        861
#define AD9                           862
#define nWR                           863
#define WRE                           864
#define RE1                           865
#define PC2                           866
#define P2B                           867
#define nCS                           868
#define NOT_CS                        869
#define CS                            870
#define CCP10                         871
#define PB2                           872
#define AD10                          873
#define RE2                           874
#define CCP9                          875
#define CCP9E                         876
#define P3C                           877
#define REFO                          878
#define AD11                          879
#define RE3                           880
#define PC3E                          881
#define PB3E                          882
#define CCP8                          883
#define P3B                           884
#define AD12                          885
#define RE4                           886
#define CCP8E                         887
#define CCP7                          888
#define P1C                           889
#define CCP7E                         890
#define AD13                          891
#define RE5                           892
#define PC1E                          893
#define CCP6E                         894
#define CCP6                          895
#define P1B                           896
#define AD14                          897
#define RE6                           898
#define PB1E                          899
#define CCP2E                         900
#define PORTE_P2A                     901
#define PA2E                          902
#define PORTE_CCP2                    903
#define AD15                          904
#define RE7                           905
#define PORTF                         906
#define C2OUTF                        907
#define AN6                           908
#define PORTF_C2OUT                   909
#define RF1                           910
#define CTDIN                         911
#define PORTF_C1OUT                   912
#define AN7                           913
#define RF2                           914
#define C1OUTF                        915
#define AN8                           916
#define RF3                           917
#define CTMUI                         918
#define C2INB                         919
#define AN9                           920
#define RF4                           921
#define C2INA                         922
#define C1INB                         923
#define RF5                           924
#define CVREF                         925
#define AN10                          926
#define C1INA                         927
#define RF6                           928
#define AN11                          929
#define SS1                           930
#define AN5                           931
#define RF7                           932
#define PORTG                         933
#define CCP3                          934
#define PA3                           935
#define RG0                           936
#define C3OUTG                        937
#define PORTG_C3OUT                   938
#define TX2                           939
#define RG1                           940
#define CK2                           941
#define AN19                          942
#define C3INA                         943
#define RX2                           944
#define RG2                           945
#define DT2                           946
#define AN18                          947
#define CCP4                          948
#define PD3                           949
#define C3INB                         950
#define RG3                           951
#define AN17                          952
#define CCP5                          953
#define PD1                           954
#define C3INC                         955
#define T7CKI                         956
#define T5G                           957
#define RG4                           958
#define RTCC                          959
#define AN16                          960
#define PORTG_RJPU                    961
#define RG5                           962
#define LATA                          963
#define LATA0                         964
#define LA0                           965
#define LATA1                         966
#define LA1                           967
#define LATA2                         968
#define LA2                           969
#define LATA3                         970
#define LA3                           971
#define LATA4                         972
#define LA4                           973
#define LATA5                         974
#define LA5                           975
#define LATA6                         976
#define LA6                           977
#define LATA7                         978
#define LA7                           979
#define LATB                          980
#define LB0                           981
#define LATB0                         982
#define LB1                           983
#define LATB1                         984
#define LB2                           985
#define LATB2                         986
#define LB3                           987
#define LATB3                         988
#define LB4                           989
#define LATB4                         990
#define LB5                           991
#define LATB5                         992
#define LB6                           993
#define LATB6                         994
#define LB7                           995
#define LATB7                         996
#define LATC                          997
#define LATC0                         998
#define LC0                           999
#define LATC1                         1000
#define LC1                           1001
#define LATC2                         1002
#define LC2                           1003
#define LATC3                         1004
#define LC3                           1005
#define LATC4                         1006
#define LC4                           1007
#define LATC5                         1008
#define LC5                           1009
#define LATC6                         1010
#define LC6                           1011
#define LATC7                         1012
#define LC7                           1013
#define LATD                          1014
#define LATD0                         1015
#define LD0                           1016
#define LATD1                         1017
#define LD1                           1018
#define LATD2                         1019
#define LD2                           1020
#define LATD3                         1021
#define LD3                           1022
#define LATD4                         1023
#define LD4                           1024
#define LATD5                         1025
#define LD5                           1026
#define LATD6                         1027
#define LD6                           1028
#define LATD7                         1029
#define LD7                           1030
#define LATE                          1031
#define LATE0                         1032
#define LE0                           1033
#define LATE1                         1034
#define LE1                           1035
#define LATE2                         1036
#define LE2                           1037
#define LATE3                         1038
#define LE3                           1039
#define LATE4                         1040
#define LE4                           1041
#define LATE5                         1042
#define LE5                           1043
#define LATE6                         1044
#define LE6                           1045
#define LATE7                         1046
#define LE7                           1047
#define LATF                          1048
#define LATF1                         1049
#define LF1                           1050
#define LF2                           1051
#define LATF2                         1052
#define LF3                           1053
#define LATF3                         1054
#define LF4                           1055
#define LATF4                         1056
#define LF5                           1057
#define LATF5                         1058
#define LF6                           1059
#define LATF6                         1060
#define LF7                           1061
#define LATF7                         1062
#define LATG                          1063
#define LATG0                         1064
#define LG0                           1065
#define LATG1                         1066
#define LG1                           1067
#define LATG2                         1068
#define LG2                           1069
#define LATG3                         1070
#define LG3                           1071
#define LATG4                         1072
#define LG4                           1073
#define TRISA                         1074
#define TRISA0                        1075
#define TRISA1                        1076
#define TRISA2                        1077
#define TRISA3                        1078
#define TRISA4                        1079
#define TRISA5                        1080
#define TRISA6                        1081
#define TRISA7                        1082
#define TRISB                         1083
#define TRISB0                        1084
#define TRISB1                        1085
#define TRISB2                        1086
#define TRISB3                        1087
#define TRISB4                        1088
#define TRISB5                        1089
#define TRISB6                        1090
