tiborsimon/embedded-tdd-headers/pic/pic18/pic18f65k22_tdd.h
#define TRISB7                        1091
#define TRISC                         1092
#define TRISC0                        1093
#define TRISC1                        1094
#define TRISC2                        1095
#define TRISC3                        1096
#define TRISC4                        1097
#define TRISC5                        1098
#define TRISC6                        1099
#define TRISC7                        1100
#define TRISD                         1101
#define TRISD0                        1102
#define TRISD1                        1103
#define TRISD2                        1104
#define TRISD3                        1105
#define TRISD4                        1106
#define TRISD5                        1107
#define TRISD6                        1108
#define TRISD7                        1109
#define TRISE                         1110
#define TRISE0                        1111
#define TRISE1                        1112
#define TRISE2                        1113
#define TRISE3                        1114
#define TRISE4                        1115
#define TRISE5                        1116
#define TRISE6                        1117
#define TRISE7                        1118
#define TRISF                         1119
#define TRISF1                        1120
#define TRISF2                        1121
#define TRISF3                        1122
#define TRISF4                        1123
#define TRISF5                        1124
#define TRISF6                        1125
#define TRISF7                        1126
#define TRISG                         1127
#define TRISG0                        1128
#define TRISG1                        1129
#define TRISG2                        1130
#define TRISG3                        1131
#define TRISG4                        1132
#define OSCTUNE                       1133
#define TUN0                          1134
#define TUN                           1135
#define TUN1                          1136
#define TUN2                          1137
#define TUN3                          1138
#define TUN4                          1139
#define TUN5                          1140
#define PLLEN                         1141
#define INTSRC                        1142
#define PSTR1CON                      1143
#define PSTR1CON_STRA                 1144
#define PSTR1CON_STRB                 1145
#define PSTR1CON_STRC                 1146
#define PSTR1CON_STRD                 1147
#define PSTR1CON_STRSYNC              1148
#define PSTR1CON_CMPL0                1149
#define PSTR1CON_CMPL                 1150
#define PSTR1CON_CMPL1                1151
#define PIE1                          1152
#define TMR1IE                        1153
#define TMR2IE                        1154
#define TMR1GIE                       1155
#define SSP1IE                        1156
#define SSPIE                         1157
#define TXIE                          1158
#define TX1IE                         1159
#define RCIE                          1160
#define RC1IE                         1161
#define ADIE                          1162
#define PSPIE                         1163
#define PIR1                          1164
#define TMR1IF                        1165
#define TMR2IF                        1166
#define TMR1GIF                       1167
#define SSPIF                         1168
#define SSP1IF                        1169
#define TXIF                          1170
#define TX1IF                         1171
#define RCIF                          1172
#define RC1IF                         1173
#define ADIF                          1174
#define PSPIF                         1175
#define IPR1                          1176
#define TMR1IP                        1177
#define TMR2IP                        1178
#define TMR1GIP                       1179
#define SSPIP                         1180
#define SSP1IP                        1181
#define TX1IP                         1182
#define TXIP                          1183
#define RCIP                          1184
#define RC1IP                         1185
#define ADIP                          1186
#define PSPIP                         1187
#define PIE2                          1188
#define TMR3GIE                       1189
#define TMR3IE                        1190
#define HLVDIE                        1191
#define LVDIE                         1192
#define BCL1IE                        1193
#define BCLIE                         1194
#define BCL2IE                        1195
#define SSP2IE                        1196
#define OSCFIE                        1197
#define PIR2                          1198
#define TMR3GIF                       1199
#define TMR3IF                        1200
#define HLVDIF                        1201
#define LVDIF                         1202
#define BCLIF                         1203
#define BCL1IF                        1204
#define BCL2IF                        1205
#define SSP2IF                        1206
#define OSCFIF                        1207
#define IPR2                          1208
#define TMR3GIP                       1209
#define TMR3IP                        1210
#define HLVDIP                        1211
#define LVDIP                         1212
#define BCLIP                         1213
#define BCL1IP                        1214
#define BCL2IP                        1215
#define SSP2IP                        1216
#define OSCFIP                        1217
#define PIE3                          1218
#define RXB0IE                        1219
#define RTCCIE                        1220
#define RXBNIE                        1221
#define CCP1IE                        1222
#define RXB1IE                        1223
#define CCP2IE                        1224
#define TXB0IE                        1225
#define CTMUIE                        1226
#define TXB1IE                        1227
#define TXBNIE                        1228
#define TXB2IE                        1229
#define TX2IE                         1230
#define RC2IE                         1231
#define TMR5GIE                       1232
#define PIR3                          1233
#define RTCCIF                        1234
#define RXBNIF                        1235
#define CCP1IF                        1236
#define CCP2IF                        1237
#define CTMUIF                        1238
#define TXBNIF                        1239
#define TX2IF                         1240
#define RC2IF                         1241
#define TMR5GIF                       1242
#define IPR3                          1243
#define RTCCIP                        1244
#define CCP1IP                        1245
#define RXBNIP                        1246
#define CCP2IP                        1247
#define CTMUIP                        1248
#define TX2IP                         1249
#define TXBNIP                        1250
#define RC2IP                         1251
#define TMR5GIP                       1252
#define PIR6                          1253
#define CMP1IF                        1254
#define CMP2IF                        1255
#define CMP3IF                        1256
#define EEIF                          1257
#define PSPCON                        1258
#define PSPMODE                       1259
#define IBOV                          1260
#define OBF                           1261
#define IBF                           1262
#define HLVDCON                       1263
#define HLVDL                         1264
#define HLVDL0                        1265
#define HLVDL1                        1266
#define HLVDL2                        1267
#define HLVDL3                        1268
#define HLVDEN                        1269
#define IRVST                         1270
#define BGVST                         1271
#define VDIRMAG                       1272
#define IPR6                          1273
#define CMP1IP                        1274
#define CMP2IP                        1275
#define CMP3IP                        1276
#define EEIP                          1277
#define T1GCON                        1278
#define T1GSS0                        1279
#define T1GSS                         1280
#define T1GSS1                        1281
#define T1GVAL                        1282
#define T1GGO_nT1DONE                 1283
#define nT1DONE                       1284
#define T1GGO_NOT_T1DONE              1285
#define NOT_T1DONE                    1286
#define T1GGO                         1287
#define T1GSPM                        1288
#define T1GTM                         1289
#define T1GPOL                        1290
#define TMR1GE                        1291
#define RCSTA1                        1292
#define RCSTA1_RX9D                   1293
#define RX9D1                         1294
#define RCD8                          1295
#define RCSTA1_OERR                   1296
#define OERR1                         1297
#define RCSTA1_FERR                   1298
#define FERR1                         1299
#define RCSTA1_ADDEN                  1300
#define ADDEN1                        1301
#define ADEN                          1302
#define RCSTA1_CREN                   1303
#define CREN1                         1304
#define SRENA                         1305
#define SREN1                         1306
#define RCSTA1_SREN                   1307
#define RC8_9                         1308
#define RCSTA1_RX9                    1309
#define nRC8                          1310
#define NOT_RC8                       1311
#define RC9                           1312
#define RX91                          1313
#define RCSTA1_SPEN                   1314
#define SPEN1                         1315
#define TXSTA1                        1316
#define TX9D1                         1317
#define TXSTA1_TX9D                   1318
#define TXD8                          1319
#define TRMT1                         1320
#define TXSTA1_TRMT                   1321
#define BRGH1                         1322
#define TXSTA1_BRGH                   1323
#define TXSTA1_SENDB                  1324
#define SENDB1                        1325
#define TXSTA1_SYNC                   1326
#define SYNC1                         1327
#define TXEN1                         1328
#define TXSTA1_TXEN                   1329
#define TX91                          1330
#define TX8_9                         1331
#define NOT_TX8                       1332
#define nTX8                          1333
#define TXSTA1_TX9                    1334
#define TXSTA1_CSRC                   1335
#define CSRC1                         1336
#define TXREG1                        1337
#define RCREG1                        1338
#define SPBRG1                        1339
#define T3GCON                        1340
#define T3GSS0                        1341
#define T3GSS                         1342
#define T3GSS1                        1343
#define T3GVAL                        1344
#define T3GGO                         1345
#define NOT_T3DONE                    1346
#define nT3DONE                       1347
#define T3GGO_nT3DONE                 1348
#define T3GGO_NOT_T3DONE              1349
#define T3GSPM                        1350
#define T3GTM                         1351
#define T3GPOL                        1352
#define TMR3GE                        1353
#define T3CON                         1354
#define TMR3ON                        1355
#define T3CON_RD16                    1356
#define nT3SYNC                       1357
#define NOT_T3SYNC                    1358
#define SOSCEN3                       1359
#define T3CON_SOSCEN                  1360
#define T3CKPS0                       1361
#define T3CKPS                        1362
#define T3CKPS1                       1363
#define TMR3CS0                       1364
#define TMR3CS                        1365
#define TMR3CS1                       1366
#define T3RD16                        1367
#define RD163                         1368
#define TMR3L                         1369
#define TMR3H                         1370
#define CMSTAT                        1371
#define CMSTAT_C1OUT                  1372
#define CMP1OUT                       1373
#define CMSTAT_C2OUT                  1374
#define CMP2OUT                       1375
#define CMP3OUT                       1376
#define CMSTAT_C3OUT                  1377
#define CVRCON                        1378
#define CVR                           1379
#define CVR0                          1380
#define CVR1                          1381
#define CVR2                          1382
#define CVR3                          1383
#define CVR4                          1384
#define CVRR                          1385
#define CVRSS                         1386
#define CVROEN                        1387
#define CVROE                         1388
#define CVREN                         1389
#define PIE4                          1390
#define CCP3IE                        1391
#define CCP4IE                        1392
#define CCP5IE                        1393
#define CCP6IE                        1394
#define CCP7IE                        1395
#define CCP8IE                        1396
#define PIR4                          1397
#define CCP3IF                        1398
#define CCP4IF                        1399
#define CCP5IF                        1400
#define CCP6IF                        1401
#define CCP7IF                        1402
#define CCP8IF                        1403
#define IPR4                          1404
#define CCP3IP                        1405
#define CCIP3IP                       1406
#define CCP4IP                        1407
#define CCP5IP                        1408
#define CCP6IP                        1409
#define CCP7IP                        1410
#define CCP8IP                        1411
#define PIE5                          1412
#define TMR4IE                        1413
#define TMR5IE                        1414
#define TMR6IE                        1415
#define TMR8IE                        1416
#define PIR5                          1417
#define TMR4IF                        1418
#define TMR5IF                        1419
#define TMR6IF                        1420
#define TMR8IF                        1421
#define CCP1CON                       1422
#define CCP1M0                        1423
#define CCP1M                         1424
#define CCP1M1                        1425
#define CCP1M2                        1426
#define CCP1M3                        1427
#define CCP1Y                         1428
#define DC1B                          1429
#define DC1B0                         1430
#define CCP1X                         1431
#define DC1B1                         1432
#define P1M                           1433
#define P1M0                          1434
#define P1M1                          1435
#define CCPR1L                        1436
#define CCPR1H                        1437
#define ECCP1DEL                      1438
#define P1DC                          1439
#define P1DC0                         1440
#define P1DC1                         1441
#define P1DC2                         1442
#define P1DC3                         1443
#define P1DC4                         1444
#define P1DC5                         1445
#define P1DC6                         1446
#define P1RSEN                        1447
#define PSS1BD0                       1448
#define PSS1BD                        1449
#define PSS1BD1                       1450
#define PSS1AC                        1451
#define PSS1AC0                       1452
#define PSS1AC1                       1453
#define ECCP1AS                       1454
#define ECCP1AS0                      1455
#define ECCP1AS1                      1456
#define ECCP1AS2                      1457
#define ECCP1ASE                      1458
#define ADCON2                        1459
#define ADCS0                         1460
#define ADCS                          1461
#define ADCS1                         1462
#define ADCS2                         1463
#define ACQT0                         1464
#define ACQT                          1465
#define ACQT1                         1466
#define ACQT2                         1467
#define ADFM                          1468
#define ADCON1                        1469
#define CHSN0                         1470
#define CHSN                          1471
#define CHSN1                         1472
#define CHSN2                         1473
#define VNCFG                         1474
#define CHSN3                         1475
#define VCFG                          1476
#define VCFG01                        1477
#define VCFG0                         1478
#define VCFG11                        1479
#define VCFG1                         1480
#define TRIGSEL                       1481
#define TRIGSEL0                      1482
#define TRIGSEL1                      1483
#define ADCON0                        1484
#define ADON                          1485
#define nDONE                         1486
#define GO_nDONE                      1487
#define NOT_DONE                      1488
#define GODONE                        1489
#define GO_DONE                       1490
#define DONE                          1491
#define GO_NOT_DONE                   1492
#define GO                            1493
#define CHS0                          1494
#define CHS                           1495
#define CHS1                          1496
#define CHS2                          1497
#define CHS3                          1498
#define CHS4                          1499
#define ADRESL                        1500
#define ADRESH                        1501
#define SSP1CON2                      1502
#define SEN1                          1503
#define SSP1CON2_SEN                  1504
#define ADMSK11                       1505
#define SSP1CON2_RSEN                 1506
#define RSEN1                         1507
#define SSP1CON2_ADMSK1               1508
#define SSP1CON2_PEN                  1509
#define ADMSK21                       1510
#define PEN1                          1511
#define SSP1CON2_ADMSK2               1512
#define ADMSK31                       1513
#define RCEN1                         1514
#define SSP1CON2_RCEN                 1515
#define SSP1CON2_ADMSK3               1516
#define SSP1CON2_ACKEN                1517
#define ACKEN1                        1518
#define ADMSK41                       1519
#define SSP1CON2_ADMSK4               1520
#define ACKDT1                        1521
#define ADMSK51                       1522
#define SSP1CON2_ACKDT                1523
#define SSP1CON2_ADMSK5               1524
#define SSP1CON2_ACKSTAT              1525
#define ACKSTAT1                      1526
#define GCEN1                         1527
#define SSP1CON2_GCEN                 1528
#define SSP1CON1                      1529
#define SSP1CON1_SSPM0                1530
#define SSPM01                        1531
#define SSP1CON1_SSPM                 1532
#define SSP1CON1_SSPM1                1533
#define SSPM11                        1534
#define SSP1CON1_SSPM2                1535
#define SSPM21                        1536
#define SSPM31                        1537
#define SSP1CON1_SSPM3                1538
#define SSP1CON1_CKP                  1539
#define CKP1                          1540
#define SSPEN1                        1541
#define SSP1CON1_SSPEN                1542
#define SSPOV1                        1543
#define SSP1CON1_SSPOV                1544
#define WCOL1                         1545
#define SSP1CON1_WCOL                 1546
#define SSP1STAT                      1547
#define BF1                           1548
#define SSP1STAT_BF                   1549
#define UA1                           1550
#define SSP1STAT_UA                   1551
#define SSP1STAT_R_NOT_W              1552
#define RW1                           1553
#define NOT_W                         1554
#define SSP1STAT_R                    1555
#define SSP1STAT_nW                   1556
#define RW                            1557
#define SSP1STAT_READ_WRITE           1558
#define SSP1STAT_nWRITE               1559
#define SSP1STAT_I2C_READ             1560
#define SSP1STAT_R_W                  1561
#define SSP1STAT_NOT_WRITE            1562
#define SSP1STAT_R_nW                 1563
#define SSP1STAT_S                    1564
#define START                         1565
#define SSP1STAT_I2C_START            1566
#define START1                        1567
#define STOP                          1568
#define SSP1STAT_P                    1569
#define STOP1                         1570
#define SSP1STAT_I2C_STOP             1571
#define SSP1STAT_D                    1572
#define SSP1STAT_D_NOT_A              1573
#define NOT_A                         1574
#define SSP1STAT_D_A                  1575
#define SSP1STAT_D_nA                 1576
#define SSP1STAT_NOT_ADDRESS          1577
#define SSP1STAT_nA                   1578
#define DA1                           1579
#define DA                            1580
#define SSP1STAT_I2C_DAT              1581
#define SSP1STAT_nADDRESS             1582
#define SSP1STAT_DATA_ADDRESS         1583
#define SSP1STAT_CKE                  1584
#define CKE1                          1585
#define SSP1STAT_SMP                  1586
#define SMP1                          1587
#define SSP1ADD_MSK0                  1588
#define MSK01                         1589
#define SSP1ADD                       1590
#define SSP1ADD_MSK1                  1591
#define MSK11                         1592
#define SSP1ADD_MSK2                  1593
#define MSK21                         1594
#define MSK31                         1595
#define SSP1ADD_MSK3                  1596
#define SSP1ADD_MSK4                  1597
#define MSK41                         1598
#define MSK51                         1599
#define SSP1ADD_MSK5                  1600
#define SSP1ADD_MSK6                  1601
#define MSK61                         1602
#define SSP1ADD_MSK7                  1603
#define MSK71                         1604
#define SSP1MSK                       1605
#define SSP1MSK_MSK0                  1606
#define SSP1MSK_MSK1                  1607
#define SSP1MSK_MSK2                  1608
#define SSP1MSK_MSK3                  1609
#define SSP1MSK_MSK4                  1610
#define SSP1MSK_MSK5                  1611
#define SSP1MSK_MSK6                  1612
#define SSP1MSK_MSK7                  1613
#define SSP1BUF                       1614
#define SSPBUF                        1615
#define T2CON                         1616
#define T2CKPS0                       1617
#define T2CKPS                        1618
#define T2CKPS1                       1619
#define TMR2ON                        1620
#define T2OUTPS0                      1621
#define T2OUTPS                       1622
#define T2OUTPS1                      1623
#define T2OUTPS2                      1624
#define T2OUTPS3                      1625
#define WM0                           1626
#define PR2                           1627
#define WM1                           1628
#define WAIT0                         1629
#define WAIT1                         1630
#define EBDIS                         1631
#define TMR2                          1632
#define T1CON                         1633
#define TMR1ON                        1634
#define T1CON_RD16                    1635
#define NOT_T1SYNC                    1636
#define nT1SYNC                       1637
#define T1OSCEN                       1638
#define T1CON_SOSCEN                  1639
#define T1CKPS0                       1640
#define T1CKPS                        1641
#define T1CKPS1                       1642
#define TMR1CS0                       1643
#define TMR1CS                        1644
#define T1RD16                        1645
#define TMR1CS1                       1646
#define TMR1L                         1647
#define TMR1H                         1648
