tiborsimon/embedded-tdd-headers/pic/pic18/pic18f65k22_tdd.h
#define RCON                          1649
#define BOR                           1650
#define NOT_BOR                       1651
#define nBOR                          1652
#define POR                           1653
#define nPOR                          1654
#define NOT_POR                       1655
#define PD                            1656
#define nPD                           1657
#define NOT_PD                        1658
#define nTO                           1659
#define TO                            1660
#define NOT_TO                        1661
#define nRI                           1662
#define NOT_RI                        1663
#define RI                            1664
#define NOT_CM                        1665
#define CM                            1666
#define nCM                           1667
#define SBOREN                        1668
#define IPEN                          1669
#define WDTCON                        1670
#define SWDTEN                        1671
#define SWDTE                         1672
#define ULPSINK                       1673
#define ULPEN                         1674
#define SRETEN                        1675
#define ULPLVL                        1676
#define REGSLP                        1677
#define IPR5                          1678
#define CCH05                         1679
#define TMR4IP                        1680
#define IPR5_CCH0                     1681
#define CCH15                         1682
#define TMR5IP                        1683
#define IPR5_CCH1                     1684
#define TMR6IP                        1685
#define EVPOL05                       1686
#define IPR5_EVPOL0                   1687
#define EVPOL15                       1688
#define IPR5_EVPOL1                   1689
#define TMR8IP                        1690
#define OSCCON                        1691
#define SCS0                          1692
#define SCS                           1693
#define SCS1                          1694
#define HFIOFS                        1695
#define OSTS                          1696
#define IRCF                          1697
#define IRCF0                         1698
#define IRCF1                         1699
#define IRCF2                         1700
#define IDLEN                         1701
#define SPBRGH1                       1702
#define T0CON                         1703
#define T0PS                          1704
#define T0PS0                         1705
#define T0PS1                         1706
#define T0PS2                         1707
#define PSA                           1708
#define T0SE                          1709
#define T0CS                          1710
#define T08BIT                        1711
#define TMR0ON                        1712
#define TMR0L                         1713
#define TMR0H                         1714
#define STATUS                        1715
#define C                             1716
#define CARRY                         1717
#define DC                            1718
#define ZERO                          1719
#define Z                             1720
#define OV                            1721
#define OVERFLOW                      1722
#define N                             1723
#define NEGATIVE                      1724
#define FSR2L                         1725
#define PLUSW2                        1726
#define PREINC2                       1727
#define POSTDEC2                      1728
#define POSTINC2                      1729
#define INDF2                         1730
#define FSR1L                         1731
#define PLUSW1                        1732
#define PREINC1                       1733
#define POSTDEC1                      1734
#define POSTINC1                      1735
#define INDF1                         1736
#define WREG                          1737
#define FSR0L                         1738
#define PLUSW0                        1739
#define PREINC0                       1740
#define POSTDEC0                      1741
#define POSTINC0                      1742
#define INDF0                         1743
#define INTCON3                       1744
#define INT1IF                        1745
#define INT1F                         1746
#define INT2IF                        1747
#define INT2F                         1748
#define INT3F                         1749
#define INT3IF                        1750
#define INT1E                         1751
#define INT1IE                        1752
#define INT2IE                        1753
#define INT2E                         1754
#define INT3E                         1755
#define INT3IE                        1756
#define INT1P                         1757
#define INT1IP                        1758
#define INT2IP                        1759
#define INT2P                         1760
#define INTCON2                       1761
#define RBIP                          1762
#define INT3IP                        1763
#define INT3P                         1764
#define TMR0IP                        1765
#define T0IP                          1766
#define INTEDG3                       1767
#define INTEDG2                       1768
#define INTEDG1                       1769
#define INTEDG0                       1770
#define RBPU                          1771
#define NOT_RBPU                      1772
#define nRBPU                         1773
#define INTCON                        1774
#define RBIF                          1775
#define INT0F                         1776
#define INT0IF                        1777
#define T0IF                          1778
#define TMR0IF                        1779
#define RBIE                          1780
#define INT0E                         1781
#define INT0IE                        1782
#define T0IE                          1783
#define TMR0IE                        1784
#define PEIE                          1785
#define PEIE_GIEL                     1786
#define GIEL                          1787
#define GIE_GIEH                      1788
#define GIE                           1789
#define GIEH                          1790
#define PRODL                         1791
#define PRODH                         1792
#define TABLAT                        1793
#define TBLPTRL                       1794
#define TBLPTRH                       1795
#define PCL                           1796
#define PCLATH                        1797
#define PCH                           1798
#define SP0                           1799
#define STKPTR                        1800
#define SP1                           1801
#define SP2                           1802
#define SP3                           1803
#define SP4                           1804
#define STKUNF                        1805
#define STKOVF                        1806
#define STKFUL                        1807
#define TOSL                          1808
#define TOSH                          1809

#endif // _PIC18F65K22_H_
